# -*- Mode:Org; Coding:utf-8; fill-column:158 org-html-link-org-files-as-html:nil -*-
#+TITLE:       Inline C++ Example
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DESCRIPTION: Inline C++ Example
#+KEYWORDS:    Inline C++ Example
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil 
#+SEQ_TODO:    TODO:NEW(t)                         TODO:WORK(w)    TODO:HOLD(h)    | TODO:FUTURE(f)   TODO:DONE(d)    TODO:CANCELED(c)
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
#+HTML_HEAD: <style>body { min-width: 820px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
** Telling R about our external code

We must tell R where to find our enxternal code.  We do that with the =sourceCpp= function -- it will compile the code and create R wrappers to call the
functions.  Note that little bit of R code in the comment at the bottom of =cppInR.cpp= is exicuted when we run =sourceCpp=!

 #+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/cppInR.R"
Rcpp::sourceCpp('cppInR.cpp')
 #+END_SRC

 #+RESULTS:
 #+begin_example
 print('HI -- I am some code in cppRcppOutOfLine.cpp')
 [1] "HI -- I am some code in cppRcppOutOfLine.cpp"
 #+end_example

* Calling our functions

Here we call our concatination functions (the internal one and external one):

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/cppInR.R"
cppIntCat(1:10, 2:11)
#+END_SRC

#+RESULTS:
#+begin_example
 [1]  1  2  3  4  5  6  7  8  9 10  2  3  4  5  6  7  8  9 10 11
#+end_example

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/cppInR.R"
cppExtCat(1:10, 2:11)
#+END_SRC

#+RESULTS:
#+begin_example
 [1]  1  2  3  4  5  6  7  8  9 10  2  3  4  5  6  7  8  9 10 11
#+end_example

Here we call our sum functions (the internal one and external one):

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/cppInR.R"
cppIntSum(1:10)
#+END_SRC

#+RESULTS:
#+begin_example
[1] 55
#+end_example

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/cppInR.R"
cppExtSum(1:10)
#+END_SRC

#+RESULTS:
#+begin_example
[1] 55
#+end_example

